Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །སེམས་ཅན་གང་གི་དོན་དུ་ཤེས་རབ་དེ་ལ་སྒོམ་པ་དེ་དག་ལ་ཡང་མཚན་མར་མི་བྱེད་དེ། དངོས་པོ་ཡོད་པ་འམ་དངོས་པོ་མེད་པར་ཡང་ཡིད་ལ་མི་བྱེད་དོ། །ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། །འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་།
en: And as far as the beings for whom they cultivate wisdom are concerned, they are without concepts—they do not conceptualize and they do not focus their attention either on entities or on nonentities. “

source: སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་སྤྱོད་པའི་ཚེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དེ་ལ་མི་རྟོག་མཚན་མར་མི་བྱེད་དེ།
en: When they practice the emptiness of internal phenomena, [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, the distinct qualities of the buddhas, and [the goals], up to and including all-aspect omniscience, as far as all-aspect omniscience [and so forth] are concerned, they are without concepts—they do not conceptualize and they do not focus their attention either on entities or on nonentities.

source: དངོས་པོ་ཡོད་པ་འམ། དངོས་པོ་མེད་པར་ཡང་ཡིད་ལ་མི་བྱེད་དོ། །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་ཡང་མི་རྟོག་མཚན་མར་མི་བྱེད་དེ། དངོས་པོ་ཡོད་པ་འམ། དངོས་པོ་མེད་པར་ཡང་ཡིད་ལ་མི་བྱེད་དོ།
en: Also, as far as [the goals], up to and including unsurpassed, complete enlightenment, are concerned, they are without concepts—they do not conceptualize and they do not focus their attention either on entities or on nonentities.

source: །གང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དང་། གང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱ་བ་དང་། གང་གིས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱ་བ་དེ་ལ་ཡང་མི་རྟོག་མཚན་མར་མི་བྱེད་དེ། དངོས་པོ་ཡོད་པ་འམ། དངོས་པོ་མེད་པར་ཡང་ཡིད་ལ་མི་བྱེད་དོ།
en: As far as the act of attaining consummate buddhahood is concerned, along with its objective, consummate buddhahood, and the one who attains consummate buddhahood, here too they are without concepts—they do not conceptualize and they do not focus their attention either on entities or on nonentities.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ཆོས་ཐམས་ཅད་ནི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དེ།
en: If you ask why, it is because all phenomena have the essential nature of nonentity.

source: དེ་དག་སངས་རྒྱས་རྣམས་ཀྱིས་ཀྱང་མ་མཛད། རང་སངས་རྒྱས་དང་ཉན་ཐོས་རྣམས་ཀྱིས་ཀྱང་མ་བྱས་ཏེ།
en: They have not been created by the buddhas, nor indeed have they been created by the pratyekabuddhas or the śrāvakas.

source: ཆོས་ཐམས་ཅད་ནི་བྱེད་པ་པོ་མེད་པ། བྱེད་པ་པོ་དང་བྲལ་བའོ།
en: All phenomena are without a creator; they are devoid of a creator.”

source: །རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ལྟ་ལགས་ན། ཆོས་རྣམས་ཆོས་རྣམས་ཉིད་དང་བྲལ་བ་ལགས་སམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Subhūti then asked, “Blessed Lord, in that case are all phenomena themselves devoid of all phenomena?” “

source: རབ་འབྱོར་ཆོས་རྣམས་ནི་ཆོས་རྣམས་ཉིད་དང་བྲལ་བའོ། །གསོལ་པ།
en: Subhūti, all phenomena themselves are devoid of all phenomena.” “

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་ལྟར་ཆོས་རྣམས་ཆོས་རྣམས་ཉིད་དང་བྲལ་བ་ལགས་ན། ཇི་ལྟར་ཆོས་ཀྱིས་ཆོས་ལ་དངོས་པོ་མཆིས་ཞེས་བགྱི་བ་འམ། དངོས་པོ་མ་མཆིས་ཞེས་བགྱི་བར་ཡོངས་སུ་འཚལ་བར་འགྱུར།
en: Blessed Lord, if all phenomena are in that way themselves devoid of all phenomena, how do phenomena cognize that phenomena are entities or that they are nonentities?

source: བཅོམ་ལྡན་འདས་དངོས་པོ་མ་མཆིས་པའི་ཆོས་ཀྱིས་དངོས་པོ་མ་མཆིས་པའི་ཆོས་ཡོངས་སུ་འཚལ་བར་མི་རུང་སྟེ།
en: Blessed Lord, phenomena that are nonentities cannot cognize phenomena that are nonentities.

source: དངོས་པོ་མཆིས་པའི་ཆོས་ཀྱིས་ཀྱང་དངོས་པོ་མཆིས་པའི་ཆོས་ཡོངས་སུ་འཚལ་བར་མི་རུང་ངོ་།
en: Nor can phenomena that are entities cognize phenomena that are entities.

source: །དངོས་པོ་མ་མཆིས་པའི་ཆོས་ཀྱིས་ཀྱང་དངོས་པོ་མཆིས་པའི་ཆོས་འཚལ་བར་མི་རུང་ངོ་།
en: Nor can phenomena that are nonentities cognize phenomena that are entities.

source: །དངོས་པོ་མཆིས་པའི་ཆོས་ཀྱིས་ཀྱང་དངོས་པོ་མ་མཆིས་པའི་ཆོས་འཚལ་བར་མི་རུང་ངོ་།
en: Nor can phenomena that are entities cognize phenomena that are nonentities.

source: །དེ་ལྟར་ཆོས་ཐམས་ཅད་ཡོངས་སུ་འཚལ་བར་མ་མཆིས་པས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྟ་དངོས་པོ་མཆིས་པ་འམ། དངོས་པོ་མ་མཆིས་པར་སེམས་པར་ཡང་ག་ལ་འགྱུར། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Since in that way all phenomena are not cognizable, how could bodhisattva great beings think that they are entities or that they are nonentities?” “

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། འཇིག་རྟེན་གྱི་ཀུན་རྫོབ་ཉེ་བར་བཟུང་བས། དངོས་པོ་ཡོད་ཅེས་བྱ་བ་འམ། དངོས་པོ་མེད་ཅེས་བྱ་བར་སྟོན་ཏེ། དོན་དམ་པར་ནི་མ་ཡིན་ནོ།
en: Subhūti,” replied the Blessed One, “when bodhisattva great beings practice the perfection of wisdom, on the basis of mundane relative [appearances] they do teach that phenomena are entities or that they are nonentities, but that is not the case in terms of ultimate [truth].” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཅི་ལགས། འཇིག་རྟེན་གྱི་ཀུན་རྫོབ་ཀྱང་གཞན་ཞིག་ལ། དོན་དམ་པ་ཡང་གཞན་ཞིག་ལགས་སམ།
en: Blessed Lord, are mundane relative [appearances] one thing and ultimate [truth] another?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འཇིག་རྟེན་གྱི་ཀུན་རྫོབ་ཀྱང་གཞན་ཞིག་ལ། དོན་དམ་པ་ཡང་གཞན་ཞིག་ཡིན་ཞེས་བྱ་བ་ཡང་མེད་དེ།
en: Subhūti,” replied the Blessed One, “mundane relative [appearances] are not one thing and ultimate [truth] another.

source: འཇིག་རྟེན་གྱི་ཀུན་རྫོབ་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ཉིད་དོན་དམ་པའི་དེ་བཞིན་ཉིད་ཡིན་ཡང་། དེ་ལ་སེམས་ཅན་དེ་དག་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་པས་དེ་བཞིན་ཉིད་དེ་མི་ཤེས་མི་མཐོང་སྟེ།
en: The real nature of mundane relative [appearances] is the real nature of ultimate [truth], but since beings misconceive it, they do not know and do not perceive that real nature.

source: དེ་དག་གི་དོན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇིག་རྟེན་གྱི་ཀུན་རྫོབ་ཀྱིས་དངོས་པོ་ཡོད་ཅེས་བྱ་བ་འམ། དངོས་པོ་མེད་ཅེས་བྱ་བར་བརྗོད་དོ།
en: For their sake bodhisattva great beings say on the basis of mundane relative [appearances] that phenomena are entities or that they are nonentities.

source: །རབ་འབྱོར་འདི་ལྟར་ཡང་། སེམས་ཅན་གང་ཇི་སྙེད་ཅིག་ཕུང་པོ་ལྔ་ལ་དངོས་པོ་ཡོད་པའི་འདུ་ཤེས་སུ་གྱུར་ཏེ། དངོས་པོ་མེད་པར་མི་ཤེས་པ་དེ་དག་གི་དོན་དུ་ཆོས་རྣམས་རབ་ཏུ་དབྱེ་བ་ཉེ་བར་བཟུང་སྟེ།
en: Subhūti, since all beings perceive the five aggregates as entities and do not perceive them as nonentities, {Ki.

source: དངོས་པོ་མེད་པར་ཡང་ཇི་ལྟར་ཤེས་པར་འགྱུར་ཞེས་ཏེ།
en: V: 139} for their sake, [bodhisattva great beings], commencing with the excellent analysis of phenomena, speak in such a way that they will indeed understand them to be nonentities.

source: དེ་སྐད་དུ་བརྗོད་དོ། །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱད་པར་བྱའོ།
en: Subhūti, bodhisattva great beings should practice the perfection of wisdom in that manner.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་ལྔ་བཅུ་བཞི་པའོ།། །།དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས།
en: This completes the fifty-fourth chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཞེས་བགྱི་ན། དེ་སྐད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཞེས་བགྱི་བ་དེ། གང་གི་ཚིག་བླ་དགས་ལགས།
en: Chapter 55 Then the venerable Subhūti asked the Blessed One, “Venerable Lord, when one speaks of the conduct of a bodhisattva, of what is the expression bodhisattva conduct a designation?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཞེས་བྱ་བ་ནི། དེ་བྱང་ཆུབ་ཀྱི་དོན་དུ་སྤྱོད་པས་ན།
en: Subhūti,” replied the Blessed One, “the expression bodhisattva conduct denotes conduct for the sake of enlightenment.

source: དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཞེས་བྱའོ། །གསོལ་པ།
en: That is why it is termed bodhisattva conduct.” “

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ལ་སྤྱོད་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, in what conduct do bodhisattva great beings engage?”

source: གཟུགས་སྟོང་པ་ཞེས་བྱ་བར་སྤྱོད་དེ། ཅི་ནས་ཀྱང་བློ་རྣམ་པ་གཉིས་སུ་མི་འགྱུར་བ་དེ་ལྟར་སྤྱོད་དོ།
en: The Blessed One replied, “They engage with the notion that physical forms are empty, yet they do so without any idea whatsoever of a duality.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྟོང་པ་ཞེས་བྱ་བར་སྤྱོད་དེ། ཅི་ནས་ཀྱང་བློ་རྣམ་པ་གཉིས་སུ་མི་འགྱུར་བ་དེ་ལྟར་སྤྱོད་དོ།
en: They engage with the notion that feelings, perceptions, formative predispositions, and consciousness are empty, yet they do so without any idea whatsoever of a duality.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་སྟོང་པ་ཞེས་བྱ་བར་སྤྱོད་དེ། ཅི་ནས་ཀྱང་བློ་རྣམ་པ་གཉིས་སུ་མི་འགྱུར་བ་དེ་ལྟར་སྤྱོད་དོ། །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: They engage with the notion that the sense fields, the sensory elements, and the links of dependent origination are empty, yet they do so without any idea whatsoever of a duality.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་པ་ཞེས་བྱ་བར་སྤྱོད།
en: They engage with the notion that the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are empty.

source: ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་སྟོང་པ་ཞེས་བྱ་བར་སྤྱོད། བསམ་གཏན་དང་པོ་དང་། བསམ་གཏན་གཉིས་པ་དང་།
en: They engage with the notion that the emptiness of internal phenomena and [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are empty.

source: བསམ་གཏན་གསུམ་པ་དང་། བསམ་གཏན་བཞི་པ་དང་། བྱམས་པ་དང་། སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་དང་། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་སྟོང་པ་ཞེས་བྱ་བར་སྤྱོད། དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་།
en: They engage with the notion that the first meditative concentration, the second meditative concentration, the third meditative concentration, the fourth meditative concentration, loving kindness, compassion, empathetic joy, equanimity, the sphere of infinite space, the sphere of infinite consciousness, the sphere of nothing-at-all, and the sphere of neither perception nor nonperception are empty.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་སྟོང་པ་ཞེས་བྱ་བར་སྤྱོད། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: They engage with the notion that the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path are empty.

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་དང་། མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་།
en: They engage with the notion that the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the meditative stability of emptiness, the meditative stability of signlessness, the meditative stability of wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas are empty.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་སྟོང་པ་ཞེས་བྱ་བར་སྤྱོད། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་སྟོང་པ་ཞེས་བྱ་བར་སྤྱོད།
en: They engage with the notion that [the goals], up to and including all-aspect omniscience, are empty.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། སྤོབས་པ་དང་། ཡི་གེ་མངོན་པར་བསྒྲུབ་པ་སྟོང་པ་ཞེས་བྱ་བར་སྤྱོད། ཡི་གེ་ལ་འཇུག་པ་དང་།
en: They engage with the notion that the refinement of the buddhafields, the maturation of beings, inspired speech, and the actualization of letters are empty.

source: ཡི་གེ་མེད་པ་ལ་འཇུག་པ་སྟོང་པ་ཞེས་བྱ་བར་སྤྱོད། གཟུགས་སྟོང་པ་ཞེས་བྱ་བར་སྤྱོད།
en: They engage with the notion that the introduction to letters and the introduction to the absence of letters are empty.

source: འདུས་བྱས་ཀྱི་ཁམས་དང་། འདུས་མ་བྱས་ཀྱི་ཁམས་སྟོང་པ་ཞེས་བྱ་བར་སྤྱོད་དེ།
en: They engage with the notion that dhāraṇīs are empty, and they engage with the notion that conditioned elements and nonconditioned elements {Ki.

source: ཅི་ནས་ཀྱང་བློ་རྣམ་པ་གཉིས་སུ་མི་འགྱུར་བ་དེ་ལྟར་སྤྱོད་དོ།། །།
en: V: 140} are empty, yet they do so without any idea whatsoever of a duality. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་དྲུག་ཅུ་གཉིས་པ། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་པ་ནི་བྱང་ཆུབ་ཏུ་སྤྱོད་པ་ཡིན་ཏེ།
en: Subhūti, bodhisattva great beings who practice the perfection of wisdom in that manner conduct themselves in enlightenment.

source: དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཞེས་བྱའོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: Therefore one speaks of ‘the bodhisattva conduct.’ ”

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སངས་རྒྱས་སངས་རྒྱས་ཞེས་བགྱི་ན། སངས་རྒྱས་ཞེས་བགྱི་བ་དེ། གང་གི་ཚིག་བླ་དགས་ལགས།
en: The venerable Subhūti then asked the Blessed One, “Blessed Lord, when one speaks of a buddha, what does the term buddha designate?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཡང་དག་པའི་དོན་ནི་སངས་རྒྱས་ཞེས་བྱ་སྟེ།
en: Subhūti,” replied the Blessed One, “it is genuine reality that is called buddha.

source: རབ་འབྱོར་ཡང་འདི་ལྟར་དེས་ཡང་དག་པའི་ཆོས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པས། དེའི་ཕྱིར་སངས་རྒྱས་ཞེས་བྱའོ།
en: Moreover, Subhūti, it is because they have attained that genuine reality that is consummate buddhahood that buddhas are so called.

source: །ཡང་དག་པའི་དོན་རབ་ཏུ་རྟོགས་པས། དེའི་ཕྱིར་སངས་རྒྱས་ཞེས་བྱའོ།
en: Buddhas are so called because they have realized genuine reality.

source: །རབ་འབྱོར་ཡང་འདི་ལྟར་དེས་ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པས། དེའི་ཕྱིར་སངས་རྒྱས་ཞེས་བྱའོ།
en: Moreover, Subhūti, buddhas are so called because they have definitively attained consummate buddhahood with respect to all phenomena.”

source: །རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་བྱང་ཆུབ་ཅེས་བགྱི་ན། བྱང་ཆུབ་ཅེས་བགྱི་བ་དེ་གང་གི་ཚིག་བླ་དགས་ལགས།
en: Subhūti then asked, “Blessed Lord, when one speaks of ‘enlightenment,’ what does the term enlightenment designate?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་བྱང་ཆུབ་ཅེས་བྱ་བ་དེ་ནི་སྟོང་པ་ཉིད་ཀྱི་ཚིག་བླ་དགས་ལགས་སོ། །དེ་ནི་དེ་བཞིན་ཉིད་ཀྱི་ཚིག་བླ་དགས་སོ། །འདི་ནི་མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་།
en: Subhūti,” replied the Blessed One, “enlightenment designates emptiness.

source: གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་།
en: It designates the real nature.

source: ཆོས་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་ཀྱི་གནས་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་། ཡང་དག་པའི་མཐའི་ཚིག་བླ་དགས་སོ།
en: It designates the unmistaken real nature, the one and only real nature, reality, the realm of phenomena, the abiding nature of reality, maturity with respect to all phenomena, and the very limit of reality.

source: །རབ་འབྱོར་ཡང་འདི་ལྟར་བྱང་ཆུབ་ཅེས་བྱ་བ་དེ་ནི། དེ་བཞིན་ཉིད་མ་ནོར་བ་དེ་བཞིན་ཉིད། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད། རྣམ་པ་གཞན་དུ་མི་འགྱུར་བ་སྟེ། དེའི་ཕྱིར་བྱང་ཆུབ་ཅེས་བྱའོ།
en: Moreover, Subhūti, enlightenment is so called because this ‘enlightenment’ is the real nature, the unmistaken real nature, the one and only real nature, and it is unalterable.

source: །རབ་འབྱོར་འདི་ལྟར་ཡང་འདི་ལྟ་སྟེ། བྱང་ཆུབ་ཅེས་བྱ་བ་འདི་ནི་མིང་དང་མཚན་མ་ཙམ་སྟེ། དེའི་ཕྱིར་བྱང་ཆུབ་ཅེས་བྱའོ།
en: Moreover, Subhūti, enlightenment is so called because this ‘enlightenment’ is a mere name or sign.

source: །རབ་འབྱོར་ཡང་འདི་ལྟར་ཡང་དག་པའི་དོན་ནི་བྱང་ཆུབ་ཀྱི་དོན་ཏོ།
en: Moreover, Subhūti, genuine reality is the meaning of enlightenment.

source: །རབ་འབྱོར་ཡང་འདི་ལྟར་དེ་ནི་ཆོས་ཐམས་ཅད་མིང་དང་མཚན་མ་ཙམ་དུ་རྟོགས་པར་བྱེད་པ་སྟེ། དེའི་ཕྱིར་བྱང་ཆུབ་ཅེས་བྱའོ།
en: Moreover, Subhūti, enlightenment is so called because it is the realization that all phenomena are merely names or signs.

source: །རབ་འབྱོར་ཡང་འདི་ལྟར་དབྱེར་མེད་པའི་དོན་ནི་བྱང་ཆུབ་ཀྱི་དོན་ཏོ།
en: Moreover, Subhūti, indivisible reality is the meaning of enlightenment.

source: །རབ་འབྱོར་ཡང་འདི་ལྟར་དེ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བྱང་ཆུབ་སྟེ། དེའི་ཕྱིར་བྱང་ཆུབ་ཅེས་བྱའོ།
en: Moreover, Subhūti, enlightenment is so called because it is the enlightenment of the lord buddhas.

source: །རབ་འབྱོར་ཡང་འདི་ལྟར་དེ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པས་ན། དེའི་ཕྱིར་བྱང་ཆུབ་ཅེས་བྱའོ། །གསོལ་པ།
en: Moreover, Subhūti, enlightenment is so called because it is the consummate buddhahood that the lord buddhas have attained.” “

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་བྱང་ཆུབ་འདི་ལ་སྤྱོད་པ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པ་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་ལ་སྤྱོད་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་སྤྱོད་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ལ་སྤྱོད་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་སྤྱོད་པའི་དགེ་བའི་རྩ་བ་གང་དང་གང་ཚོགས་སུ་འགྱུར་བ་འམ།
en: Blessed Lord, with regard to the roots of virtuous action of those bodhisattva great beings who conduct themselves in this enlightenment, and who practice the six perfections; practice all the aspects of emptiness; practice the thirty-seven factors conducive to enlightenment; practice the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas; and who engage in [the goals], up to and including all-aspect omniscience, do they accumulate or do they decline?

source: འགྲིབ་པ་འམ། འགོད་པ་འམ། འཕེལ་བ་འམ།
en: Do they decrease or do they increase?

source: སྐྱེ་བ་འམ། འགག་པ་འམ།
en: Do they arise or do they cease?

source: ཀུན་ནས་ཉོན་མོངས་པ་འམ། རྣམ་པར་བྱང་བར་འགྱུར་བ་ལགས།
en: Are they afflicted or are they purified?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་བྱང་ཆུབ་འདི་ལ་སྤྱོད་པ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པ་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་ལ་སྤྱོད་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་སྤྱོད་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: Subhūti,” replied the Blessed One, “with regard to those bodhisattva great beings who conduct themselves in this enlightenment, and who practice the six perfections; practice all the aspects of emptiness; practice the thirty-seven factors conducive to enlightenment; {Ki.

source: སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་ལ་སྤྱོད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ལ་སྤྱོད་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་སྤྱོད་པ་དེ་ལ། ཆོས་གང་ཡང་ཚོགས་སུ་འགྱུར་བ་འམ། འགྲིབ་པ་འམ། འགོད་པ་འམ། འཕེལ་བ་འམ། སྐྱེ་བ་འམ། འགག་པ་འམ། ཀུན་ནས་ཉོན་མོངས་པ་འམ།
en: V: 141} practice the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas; and who engage in [the goals], up to and including all-aspect omniscience, nothing at all accumulates or declines, nothing decreases or increases, nothing arises or ceases, and nothing is defiled or purified.

source: རྣམ་པར་བྱང་བར་འགྱུར་བ་གང་ཡང་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་ནི་ཆོས་གང་ཡང་ཚོགས་སུ་འགྱུར་བ་འམ། འགྲིབ་པར་བྱ་བ་འམ། འགོད་པར་བྱ་བ་འམ། འཕེལ་བར་བྱ་བ་འམ། སྐྱེ་བར་བྱ་བ་འམ། འགག་པར་བྱ་བ་འམ། ཀུན་ནས་ཉོན་མོངས་པར་བྱ་བ་འམ། རྣམ་པར་བྱང་བར་བྱ་བའི་ཕྱིར་དེ་དམིགས་པའི་ཚུལ་གྱིས་ཉེ་བར་གནས་པ་མ་ཡིན་ནོ། །གསོལ་པ།
en: If you ask why, Subhūti, it is because, with regard to the enlightenment of bodhisattva great beings who practice the perfection of wisdom, nothing is established by way of apprehending, so that nothing at all will accumulate or decline, decrease or increase, arise or cease, or be defiled or purified.” “

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་ནི། ཆོས་གང་ཡང་ཚོགས་སུ་འགྱུར་བ་འམ། འགྲིབ་པར་བགྱི་བ་འམ། འགོད་པར་བགྱི་བ་འམ། འཕེལ་བར་བགྱི་བ་འམ། སྐྱེ་བར་བགྱི་བ་འམ། འགག་པར་བགྱི་བ་འམ། ཀུན་ནས་ཉོན་མོངས་པར་བགྱི་བ་འམ་རྣམ་པར་བྱང་བར་བགྱི་བའི་སླད་དུ། དམིགས་པའི་ཚུལ་གྱིས་ཉེ་བར་གནས་པ་མ་ལགས་ན། བཅོམ་ལྡན་འདས་འོ་ན་དེ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཇི་ལྟར་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པར་འགྱུར།
en: Blessed Lord, if, with regard to the enlightenment of bodhisattva great beings who practice the perfection of wisdom, nothing is established by way of apprehending, so that nothing at all will accumulate or decline, decrease or increase, arise or cease, or be defiled or purified—in that case, Blessed Lord, when bodhisattva great beings practice the perfection of wisdom, how will they acquire the perfection of generosity?

source: ཇི་ལྟར་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པར་འགྱུར།
en: How will they acquire the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom?

source: ཇི་ལྟར་ནང་སྟོང་པ་ཉིད་ལ་སྤྱོད་པར་འགྱུར།
en: How will they practice the emptiness of internal phenomena?

source: ཇི་ལྟར་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་སྤྱོད་པར་འགྱུར། ཇི་ལྟར་དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་།
en: How will they practice [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities?

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་སྤྱོད་པར་འགྱུར།
en: How will they practice the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path?
